Revit 2027 API
BaseExportOptions.SetExportLinetypeTable Method
 Sets the line type table to use during export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportLinetypeTable(
	ExportLinetypeTable linetypeTable
)
Public Sub SetExportLinetypeTable (
	linetypeTable As ExportLinetypeTable
)
public:
void SetExportLinetypeTable(
	ExportLinetypeTable^ linetypeTable
)
member SetExportLinetypeTable :
        linetypeTable : ExportLinetypeTable -> unit
Parameters
linetypeTable ExportLinetypeTable
 The line type table to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace